artillery-tests/create-users.yml
config:
  # target: "TYPE HERE THE DEPLOYED TARGET"
  target: "http://localhost:8080/scc2223-proj1-1.0/rest"
  http:
    timeout: 10
  plugins:
    metrics-by-endpoint: {}
  processor: "./test-utils.js"
  variables:
    metricsProcessEndpoint: "myProcessEndpoint" # function used to aggregate endpoints for statistics
  phases:
    - name: "Create users" # Create users
      duration: 1
      arrivalCount: 1

scenarios:
  - name: "Create users"
    weight: 1
    flow:
      - loop:
          - post: # First: post image for the user
              url: "/media"
              headers:
                Content-Type: application/octet-stream
                Accept: application/json
              beforeRequest: "uploadImageBody"
              capture:
                regexp: "(.+)"
                as: "imageId" # capture the reply as image id to be used in user creation
          - function: "genNewUser" # Generate the needed information for the user
          - post:
              url: "/user"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                nickname: "{{ nickname }}"
                name: "{{ name }}"
                pwd: "{{ pwd }}"
                photoId: "{{ imageId }}"
              afterResponse: "processNewUserReply" # capture result and store in file
        count: 10 # 10 users