artillery-tests/get-bids.yml
#TODO: create all get tests
#TODO: create cache no-cahe get bids
config:
  #target: "TYPE HERE THE DEPLOYED TARGET"
  target: "http://localhost:8080/scc2223-proj1-1.0/rest"
  http:
    timeout: 10
  plugins:
    metrics-by-endpoint: {}
  processor: "./test-utils.js"
  variables:
    metricsProcessEndpoint: "myProcessEndpoint" # function used to aggregate endpoints for statistics
  phases:
    - name: "Get bids" # Get bids
      duration: 1
      arrivalCount: 1

scenarios:
  - name: "Get bids"
    weight: 1
    flow:
      - loop:
          - function: ""